const glossary = [
    {
        "id": 1,
        "word": "Мобильное приложение",
        "description": "Компьютерная программа или прикладное программное обеспечение, предназначенное для запуска на мобильном устройстве, таком как телефон, планшет или часы."
    },
    {
        "id": 2,
        "word": "Фреймворк",
        "description": "Готовый набор инструментов, который помогает разработчику быстро создать продукт: сайт, приложение, интернет-магазин, CMS-систему."
    },
    {
        "id": 3,
        "word": "Flutter",
        "description": "Комплект средств разработки и фреймворк с открытым исходным кодом для создания мобильных приложений под Android и iOS, веб-приложений, а также настольных приложений под Windows, macOS и Linux с использованием языка программирования Dart, разработанный и развиваемый корпорацией Google."
    },
    {
        "id": 4,
        "word": "React Native",
        "description": "Платформа для разработки мобильных приложений с открытым кодом, созданная Facebook. Используется для разработки приложений для Android, iOS, Интернета и UWP (Windows). Предоставляет собственные элементы управления пользовательского интерфейса и полный доступ к собственной платформе."
    },
    {
        "id": 5,
        "word": "Dart",
        "description": "Объектно-ориентированный язык программирования, созданный Google. Используется в качестве альтернативы JavaScript. По синтаксису Dart похож на семейство языков C/С++."
    },
    {
        "id": 6,
        "word": "Кроссплатформенная разработка",
        "description": "Процесс, при котором создается одно мобильное приложение под две платформы: iOS и Android."
    },
    {
        "id": 7,
        "word": "Нативная разработка",
        "description": "Создание продукта, который пишется на оригинальных языках программирования, созданных специально для выбранной платформы."
    },
    {
        "id": 8,
        "word": "Material Design",
        "description": "Язык дизайна, разработанный компанией Google и направленный на создание современного, отзывчивого и визуально привлекательного пользовательского интерфейса для приложений Android."
    },
    {
        "id": 9,
        "word": "Cupertino",
        "description": "Язык дизайна, созданный компанией Apple для iOS-приложений. Подчеркивает чистую, минималистичную эстетику с вниманием к деталям, обеспечивая интуитивно понятный и удобный для пользователя интерфейс."
    },
    {
        "id": 10,
        "word": "Горячая перезагрузка (Hot Reload)",
        "description": "Функция горячей перезагрузки Flutter помогает вам быстро и легко экспериментировать, создавать пользовательские интерфейсы, добавлять функции и исправлять ошибки. Горячая перезагрузка работает путем внедрения обновленных файлов исходного кода в работающую виртуальную машину Dart (VM)."
    },
    {
        "id": 11,
        "word": "Stateful Widget",
        "description": "Предназначен для создания виджетов, которые хранят состояние. При этом несмотря на то, что объекты класса StatefulWidget являются неизменяемыми (immutable), их состояние является изменяемым (mutable)."
    },
    {
        "id": 12,
        "word": "Stateless Widget",
        "description": "Рекомендуется для неизменяемых виджетов. Это такие виджеты, которые не имеют внутреннего состояния, зависят только от конфигурационных параметров и от родительских виджетов."
    },
    {
        "id": 13,
        "word": "Архитектура",
        "description": "Совокупность программных и аппаратных средств, составляющая информационную систему организации и включающая, в частности, базы данных и промежуточное программное обеспечение."
    },
    {
        "id": 14,
        "word": "SKIA",
        "description": "Движок для рендеринга всего, что мы видим на экране Flutter. С помощью него можно рисовать сложные элементы интерфейса и любые 2D сцены с поддержкой плавной анимации и различных эффектов."
    },
    {
        "id": 15,
        "word": "Pub",
        "description": "Менеджер пакетов для языка программирования Dart, содержащий повторно используемые библиотеки и пакеты для программ Flutter."
    }
]

export default glossary;
